RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_efm.c
/**
 *******************************************************************************
 * @file  hc32f4a0_efm.c
 * @brief This file provides firmware functions to manage the Embedded Flash
 *        Memory unit (EFM).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-06-12       Heqb           First version
   2020-07-03       Heqb           Add flag judgment when operate SWAP
   2020-07-07       Heqb           Add flag judgment for EFM_SetOperateMode function
   2020-08-11       Heqb           1.Refine function EFM_SequenceProgram()
                                   2.Typo
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f4a0_efm.h"
#include "hc32f4a0_utility.h"

/**
 * @addtogroup HC32F4A0_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_EFM EFM
 * @brief Embedded Flash Management Driver Library
 * @{
 */

#if (DDL_EFM_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup EFM_Local_Macros EFM Local Macros
 * @{
 */
#define SECTOR_SIZE                  (0x2000UL)
#define REG_LENGTH                   (32U)
#define OTP_LOCK_ADDR_START          (0x03001800UL)
#define OTP_LOCK_ADDR_END            (0x03001AD7UL)
#define OTP_ENABLE_ADDR              (0x03001AD8UL)
#define EFM_PGM_TIMEOUT              (HCLK_VALUE / 20000UL)   /* EFM Program timeout */
#define EFM_ERASE_TIMEOUT            (HCLK_VALUE / 20UL)      /* EFM Erase timeout */
#define EFM_SEQ_PGM_TIMEOUT          (HCLK_VALUE / 2000000UL) /* EFM Sequence Program timeout */
/**
 * @defgroup EFM_Configuration_Bit_Mask EFM Configuration Bit Mask
 * @{
 */
#define EFM_CLR_FLAG_MASK      (EFM_FLAG_CLR_OTPWERR0 | EFM_FLAG_CLR_PRTWERR0 | EFM_FLAG_CLR_PGSZERR0 | \
                                EFM_FLAG_CLR_MISMTCH0 | EFM_FLAG_CLR_OPTEND0  | EFM_FLAG_CLR_CLOLERR0 | \
                                EFM_FLAG_CLR_PRTWERR1 | EFM_FLAG_CLR_PGSZERR1 | EFM_FLAG_CLR_MISMTCH1 | \
                                EFM_FLAG_CLR_OPTEND1  | EFM_FLAG_CLR_CLOLERR1)

#define EFM_CACHE_MASK         (EFM_FRMC_CRST | EFM_FRMC_PREFE | EFM_FRMC_DCACHE | EFM_FRMC_ICACHE)

#define EFM_FLAG_MASK          (EFM_FLAG_OTPWERR0 | EFM_FLAG_PRTWERR0 | EFM_FLAG_PGSZERR0 | \
                                EFM_FLAG_MISMTCH0 | EFM_FLAG_OPTEND0  | EFM_FLAG_CLOLERR0 | \
                                EFM_FLAG_PRTWERR1 | EFM_FLAG_PGSZERR1 | EFM_FLAG_MISMTCH1 | \
                                EFM_FLAG_OPTEND1  | EFM_FLAG_CLOLERR1 | EFM_FLAG_RDY0 | EFM_FLAG_RDY1)

/**
 * @}
 */

/**
 * @defgroup EFM_Check_Parameters_Validity EFM Check Parameters Validity
 * @{
 */

/*! Parameter validity check for flash latency. */
#define IS_VALID_EFM_WAIT_CYCLE(x)         ((x) <= EFM_WAIT_CYCLE_15)

/*! Parameter validity check for operate mode. */
#define IS_VALID_EFM_OPERATE_MD(x)                                   \
(   ((x) == EFM_MODE_PROGRAMSINGLE)   ||                             \
    ((x) == EFM_MODE_PROGRAMREADBACK) ||                             \
    ((x) == EFM_MODE_PROGRAMSEQUENCE) ||                             \
    ((x) == EFM_MODE_ERASESECTOR)     ||                             \
    ((x) == EFM_MODE_ERASECHIP1)      ||                             \
    ((x) == EFM_MODE_ERASEFULL)       ||                             \
    ((x) == EFM_MODE_READONLY))

/*! Parameter validity check for flash interrupt select. */
#define IS_VALID_EFM_INT_SEL(x)       (((x) | EFM_INT_MASK) == EFM_INT_MASK)

/*! Parameter validity check for flash flag. */
#define IS_VALID_EFM_FLAG(x)          (((x) | EFM_FLAG_MASK) == EFM_FLAG_MASK)

/*! Parameter validity check for flash clear flag. */
#define IS_VALID_EFM_CLRFLAG(x)       (((x) | EFM_CLR_FLAG_MASK) == EFM_CLR_FLAG_MASK)

/*! Parameter validity check for bus status while flash program or erase. */
#define IS_VALID_EFM_BUS_STATUS(x)                                   \
(   ((x) == EFM_BUS_BUSY)              ||                            \
    ((x) == EFM_BUS_RELEASE))

/*! Parameter validity check for efm data cache reset function. */
#define IS_VALID_EFM_CACHERST_FUNC(x)                                \
(   ((x) == EFM_CACHERST_ON)           ||                            \
    ((x) == EFM_CACHERST_OFF))

/*! Parameter validity check for efm prefetch function. */
#define IS_VALID_EFM_PREFETCH_FUNC(x)                                \
(   ((x) == EFM_PREFETCH_ON)           ||                            \
    ((x) == EFM_PREFETCH_OFF))

/*! Parameter validity check for efm data cache function. */
#define IS_VALID_EFM_DCHEEN_FUNC(x)                                  \
(   ((x) == EFM_DATACACHE_ON)          ||                            \
    ((x) == EFM_DATACACHE_OFF))

/*! Parameter validity check for efm instruction cache function. */
#define IS_VALID_EFM_ICHEEN_FUNC(x)                                  \
(   ((x) == EFM_INSCACHE_ON)           ||                            \
    ((x) == EFM_INSCACHE_OFF))

/*! Parameter validity check for efm status. */
#define IS_VALID_EFM_STATUS(x)                                       \
(   ((x) == EFM_FLASH0_ACT_FLASH1_ACT)     ||                        \
    ((x) == EFM_FLASH0_STP_FLASH1_ACT)     ||                        \
    ((x) == EFM_FLASH0_ACT_FLASH1_STP)     ||                        \
    ((x) == EFM_FLASH0_STP_FLASH1_STP))

/*! Parameter validity check for efm address. */
#define IS_VALID_EFM_ADDR(x)                                         \
(   ((x) <= EFM_END_ADDR)              ||                            \
    (((x) >= EFM_OTP_BLOCK16) && ((x) <= EFM_OTP_BLOCK181)))

