RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_efm.c
/*! Parameter validity check for efm chip erase address. */
#define IS_VALID_EFM_CHIP_ERASE_ADDR(x)          ((x) <= EFM_END_ADDR)

/*! Parameter validity check for sector protected register locking. */
#define IS_VALID_EFM_REG_LOCK(x)                       ((x) <= 0xFFU)

/*! Parameter validity check for efm protect register . */
#define IS_VALID_EFM_PRTREG(x)                                       \
(   ((x) == EFM_PROTECT_FWMC)          ||                            \
    ((x) == EFM_PROTECT_OTP))

/*! Parameter validity check for efm chip . */
#define IS_VALID_EFM_CHIP(x)    (((x) | EFM_FLASH0_STP_FLASH1_STP) == EFM_FLASH0_STP_FLASH1_STP)

/*! Parameter validity check for efm read mode . */
#define IS_VALID_EFM_LVREAD_MODE(x)                                  \
(   ((x) == EFM_LOWVOLREAD_ON)         ||                            \
    ((x) == EFM_LOWVOLREAD_OFF))

/*! Parameter validity check for efm erase mode . */
#define IS_VALID_EFM_ERASE_MODE(x)                                   \
(   ((x) == EFM_MODE_ERASECHIP1)       ||                            \
    ((x) == EFM_MODE_ERASEFULL))

/*! Parameter validity check for efm address alignment . */
#define IS_VALID_EFM_ADDR_ALIGNMENT(x)    (((x) | 0xFFFFFFFCUL) == 0xFFFFFFFCUL)

/*! Parameter validity check for efm sector . */
#define IS_VALID_EFM_SECTOR(x)            ((x) <= EFM_SECTOR_255)

/*! Parameter validity check for EFM lock status. */
#define IS_VALID_EFM_UNLOCK()             (M4_EFM->FAPRT == 0x00000001UL)

/*! Parameter validity check for EFM_FWMC register lock status. */
#define IS_VALID_EFM_FWMC_UNLOCK()        (bM4_EFM->FWMC_b.KEY1LOCK == 0U)

/*! Parameter validity check for OTP lock status. */
#define IS_VALID_EFM_OTP_UNLOCK()         (bM4_EFM->FWMC_b.KEY2LOCK == 0U)

/*! Parameter validity check for EFM sector number */
#define IS_VALID_EFM_SECTOR_NUM(x)         ((x) <= 256U)
/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup EFM_Global_Functions EFM Global Functions
 * @{
 */

/**
 * @brief  EFM_FWMC register unlock.
 * @param  None
 * @retval None
 * @note   Call EFM_Unlock() unlock EFM register first.
 */
void EFM_FWMC_Unlock(void)
{
    DDL_ASSERT(IS_VALID_EFM_UNLOCK());

    WRITE_REG32(M4_EFM->KEY1, 0x01234567UL);
    WRITE_REG32(M4_EFM->KEY1, 0xFEDCBA98UL);
}

/**
 * @brief  EFM_FWMC register lock.
 * @param  None
 * @retval None
 * @note   Call EFM_Unlock() and EFM_FWMC_Unlock() unlock EFM_FWMC register first.
 */
void EFM_FWMC_Lock(void)
{
    DDL_ASSERT(IS_VALID_EFM_UNLOCK());
    DDL_ASSERT(IS_VALID_EFM_FWMC_UNLOCK());

    SET_REG32_BIT(M4_EFM->FWMC, EFM_FWMC_KEY1LOCK);
}

/**
 * @brief  EFM OTP operate unlock.
 * @param  None
 * @retval None
 * @note   Call EFM_Unlock() unlock EFM register first.
 */
void EFM_OTP_WP_Unlock(void)
{
    DDL_ASSERT(IS_VALID_EFM_UNLOCK());

    WRITE_REG32(M4_EFM->KEY2, 0x10325476UL);
    WRITE_REG32(M4_EFM->KEY2, 0xEFCDAB89UL);
}

/**
 * @brief  EFM OTP write protect lock.
 * @param  None
 * @retval None
 * @note   Call EFM_Unlock() and EFM_FWMC_Unlock() unlock OTP write protect first.
 */
void EFM_OTP_WP_Lock(void)
{
    DDL_ASSERT(IS_VALID_EFM_UNLOCK());
    DDL_ASSERT(IS_VALID_EFM_FWMC_UNLOCK());

    SET_REG32_BIT(M4_EFM->FWMC, EFM_FWMC_KEY2LOCK);
}

/**
 * @brief  Enable or disable EFM.
 * @param  [in] u32EfmStatus            Specifies the flash Chip.
 *   @arg  EFM_FLASH0_ACT_FLASH1_ACT:   Flash 0 and 1 activity 0
 *   @arg  EFM_FLASH0_STP_FLASH1_ACT:   Flash 0 stop,Flash 1 activity
 *   @arg  EFM_FLASH0_ACT_FLASH1_STP:   Flash 0 activity,Flash 1 stop
 *   @arg  EFM_FLASH0_STP_FLASH1_STP:   Flash 0 and 1 stop
 * @retval None
 * @note   Call EFM_Unlock() unlock EFM register first.
 */
void EFM_Cmd(uint32_t u32EfmStatus)
{
    DDL_ASSERT(IS_VALID_EFM_STATUS(u32EfmStatus));
    DDL_ASSERT(IS_VALID_EFM_UNLOCK());
    WRITE_REG32(M4_EFM->FSTP, u32EfmStatus);
}

/**
 * @brief  Init efm config structure with default value.
 * @param  [in] pstcEfmCfg          The pointer of efm config structure.
 *   @arg  u32WaitCycle:            Specifies the efm read wait cycles.
 *   @arg  u32Prefetch:             Specifies the prefetch on or off.
 *   @arg  u32CacheRst:             Specifies the data cache reset on or off.
 *   @arg  u32InsCache:             Specifies the instruction cache on or off.
 *   @arg  u32DataCache:            Specifies the data cache on or off.
 *   @arg  u32LowVolRead:           Specifies the read of low-voltage mode on or off.
 *   @arg  u32BusStatus:            Specifies the bus status busy or release while program & erase.
 *   @arg  u32OperateMode:          Specifies the operate mode.
 *   @arg  u32FlashStatus:          Specifies the Flash status.
 * @retval An en_result_t enumeration value:
 *         - Ok: Initialize successfully
 *         - ErrorInvalidParameter: Invalid parameter
 */
en_result_t EFM_StructInit(stc_efm_cfg_t *pstcEfmCfg)
{
    en_result_t enRet = Ok;

    /* Check if pointer is NULL */
    if (NULL == pstcEfmCfg)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Configure to default value */
        pstcEfmCfg->u32WaitCycle   = EFM_WAIT_CYCLE_0;
        pstcEfmCfg->u32Prefetch    = EFM_PREFETCH_OFF;
        pstcEfmCfg->u32CacheRst    = EFM_CACHERST_OFF;
        pstcEfmCfg->u32InsCache    = EFM_INSCACHE_OFF;
        pstcEfmCfg->u32DataCache   = EFM_DATACACHE_OFF;
        pstcEfmCfg->u32LowVolRead  = EFM_LOWVOLREAD_OFF;
        pstcEfmCfg->u32BusStatus   = EFM_BUS_BUSY;
        pstcEfmCfg->u32OperateMode = EFM_MODE_READONLY;
        pstcEfmCfg->u32FlashStatus = EFM_FLASH0_ACT_FLASH1_ACT;
    }

    return enRet;
}


/**
 * @brief  Efm initialize.
 * @param  [in] pstcEfmCfg          The pointer of efm config structure.
 *   @arg  u32WaitCycle:            Specifies the efm read wait cycles.
 *   @arg  u32Prefetch:             Specifies the prefetch on or off.
 *   @arg  u32CacheRst:             Specifies the data cache reset on or off.
 *   @arg  u32InsCache:             Specifies the instruction cache on or off.
 *   @arg  u32DataCache:            Specifies the data cache on or off.
 *   @arg  u32LowVolRead:           Specifies the read of low-voltage mode on or off.
 *   @arg  u32BusStatus:            Specifies the bus status busy or release while program & erase.
 *   @arg  u32OperateMode:          Specifies the operate mode.
 *   @arg  u32FlashStatus:          Specifies the Flash status.
 * @retval An en_result_t enumeration value:
 *         - Ok: Configure success
 *         - ErrorInvalidParameter: Invalid parameter
 * @note   Call EFM_Unlock() and EFM_FWMC_Unlock() unlock EFM_FWMC register first.
 */
en_result_t EFM_Init(const stc_efm_cfg_t *pstcEfmCfg)
{
    en_result_t enRet = Ok;
    uint32_t u32Temp;
    /* Check if pointer is NULL */
    if (NULL == pstcEfmCfg)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Param valid check */
        DDL_ASSERT(IS_VALID_EFM_UNLOCK());
        DDL_ASSERT(IS_VALID_EFM_FWMC_UNLOCK());
        DDL_ASSERT(IS_VALID_EFM_WAIT_CYCLE(pstcEfmCfg->u32WaitCycle));
        DDL_ASSERT(IS_VALID_EFM_BUS_STATUS(pstcEfmCfg->u32BusStatus));
        DDL_ASSERT(IS_VALID_EFM_CACHERST_FUNC(pstcEfmCfg->u32CacheRst));
        DDL_ASSERT(IS_VALID_EFM_PREFETCH_FUNC(pstcEfmCfg->u32Prefetch));
        DDL_ASSERT(IS_VALID_EFM_DCHEEN_FUNC(pstcEfmCfg->u32DataCache));
        DDL_ASSERT(IS_VALID_EFM_ICHEEN_FUNC(pstcEfmCfg->u32InsCache));
        DDL_ASSERT(IS_VALID_EFM_LVREAD_MODE(pstcEfmCfg->u32LowVolRead));
        DDL_ASSERT(IS_VALID_EFM_OPERATE_MD(pstcEfmCfg->u32OperateMode));
        DDL_ASSERT(IS_VALID_EFM_STATUS(pstcEfmCfg->u32FlashStatus));

        u32Temp = pstcEfmCfg->u32WaitCycle | pstcEfmCfg->u32InsCache | pstcEfmCfg->u32DataCache | \
                  pstcEfmCfg->u32Prefetch | pstcEfmCfg->u32CacheRst | pstcEfmCfg->u32LowVolRead;
        /* Config efm. */
        MODIFY_REG32(M4_EFM->FRMC, EFM_FRMC_FLWT | EFM_FRMC_PREFE | EFM_FRMC_LVM | \
                                   EFM_FRMC_ICACHE | EFM_FRMC_DCACHE | EFM_FRMC_CRST, u32Temp);
        MODIFY_REG32(M4_EFM->FWMC, EFM_FWMC_BUSHLDCTL | EFM_FWMC_PEMOD, \
                                    pstcEfmCfg->u32BusStatus | pstcEfmCfg->u32OperateMode);
        MODIFY_REG32(M4_EFM->FSTP, EFM_FSTP_F0STP | EFM_FSTP_F1STP, pstcEfmCfg->u32FlashStatus);
    }

    return enRet;
}

/**
 * @brief  Set the efm read wait cycles.
 * @param  [in] u32WaitCycle            Specifies the efm read wait cycles.
 *  This parameter can be one of the following values:
 *   @arg  EFM_WAIT_CYCLE_0:            Don't insert read wait cycle
 *   @arg  EFM_WAIT_CYCLE_1:            Insert 1 read wait cycles
 *   @arg  EFM_WAIT_CYCLE_2:            Insert 2 read wait cycles
 *   @arg  EFM_WAIT_CYCLE_3:            Insert 3 read wait cycles
 *   @arg  EFM_WAIT_CYCLE_4:            Insert 4 read wait cycles
 *   @arg  EFM_WAIT_CYCLE_5:            Insert 5 read wait cycles
 *   @arg  EFM_WAIT_CYCLE_6:            Insert 6 read wait cycles
 *   @arg  EFM_WAIT_CYCLE_7:            Insert 7 read wait cycles
 *   @arg  EFM_WAIT_CYCLE_8:            Insert 8 read wait cycles
 *   @arg  EFM_WAIT_CYCLE_9:            Insert 9 read wait cycles
 *   @arg  EFM_WAIT_CYCLE_10:           Insert 10 read wait cycles
 *   @arg  EFM_WAIT_CYCLE_11:           Insert 11 read wait cycles
 *   @arg  EFM_WAIT_CYCLE_12:           Insert 12 read wait cycles
 *   @arg  EFM_WAIT_CYCLE_13:           Insert 13 read wait cycles
 *   @arg  EFM_WAIT_CYCLE_14:           Insert 14 read wait cycles
 *   @arg  EFM_WAIT_CYCLE_15:           Insert 15 read wait cycles
 * @retval None
 * @note   Call EFM_Unlock() unlock EFM register first.
 */
void EFM_SetWaitCycle(uint32_t u32WaitCycle)
{
    /* Param valid check */
    DDL_ASSERT(IS_VALID_EFM_UNLOCK());
    DDL_ASSERT(IS_VALID_EFM_WAIT_CYCLE(u32WaitCycle));
    /* Set the code latency value. */
    MODIFY_REG32(M4_EFM->FRMC, EFM_FRMC_FLWT, u32WaitCycle);
}

/**
 * @brief  Enable or disable the flash data cache reset.
 * @param  [in] enNewState           The new status of the flash data cache reset.
 *   @arg  This parameter can be: Enable or Disable.
 * @retval None
 * @note   Call EFM_Unlock() unlock EFM register first.
 */
void EFM_DataCacheRstCmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_VALID_EFM_UNLOCK());

    WRITE_REG32(bM4_EFM->FRMC_b.CRST, enNewState);
}

/**
 * @brief  Enable or disable the flash prefetch.
 * @param  [in] enNewState                The new state of the flash prefetch.
 *   @arg  This parameter can be: Enable or Disable.
 * @retval None
 * @note   Call EFM_Unlock() unlock EFM register first.
 */
void EFM_PrefetchCmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_VALID_EFM_UNLOCK());

    WRITE_REG32(bM4_EFM->FRMC_b.PREFE, enNewState);
}

/**
 * @brief  Enable or disable the flash data cache.
 * @param  [in] enNewState                The new state of the flash data cache.
 *   @arg  This parameter can be: Enable or Disable.
 * @retval None
 * @note   Call EFM_Unlock() unlock EFM register first.
 */
void EFM_DataCacheCmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_VALID_EFM_UNLOCK());

    WRITE_REG32(bM4_EFM->FRMC_b.DCACHE, enNewState);
}

/**
 * @brief  Enable or disable the flash instruction cache.
 * @param  [in] enNewState                The new state of the flash instruction cache.
 *   @arg  This parameter can be: Enable or Disable.
 * @retval None
 * @note   Call EFM_Unlock() unlock EFM register first.
 */
void EFM_InsCacheCmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_VALID_EFM_UNLOCK());

    WRITE_REG32(bM4_EFM->FRMC_b.ICACHE, enNewState);
}

/**
 * @brief  Enable or disable the Read of low-voltage mode.
 * @param  [in] enNewState                The new state of the flash Low voltage read mode.
 *   @arg  This parameter can be: Enable or Disable.
 * @retval None
 * @note   Call EFM_Unlock() unlock EFM register first.
 */
void EFM_LowVolReadCmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_VALID_EFM_UNLOCK());

