RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_efm.c
    WRITE_REG32(bM4_EFM->FRMC_b.LVM, enNewState);
}

/**
 * @brief  Set the FLASH erase program mode .
 * @param  [in] u32PgmMode                  Specifies the FLASH erase program mode.
 *  This parameter can be one of the following values:
 *   @arg  EFM_MODE_PROGRAMSINGLE:          Program single at a specified address
 *   @arg  EFM_MODE_PROGRAMREADBACK:        Program and read back at a specified address
 *   @arg  EFM_MODE_PROGRAMSEQUENCE:        Program sequence at sequence address
 *   @arg  EFM_MODE_ERASESECTOR:            Sector erase
 *   @arg  EFM_MODE_ERASECHIP1:             A flash Chip erase
 *   @arg  EFM_MODE_ERASEFULL:              Two flash Chip erase
 *   @arg  EFM_MODE_READONLY:               Read only
 * @retval An en_result_t enumeration value:
 *         - Ok: Success
 *         - ErrorTimeout: Process timeout
 * @note   Call EFM_Unlock() and EFM_FWMC_Unlock() unlock EFM_FWMC register first.
 */
en_result_t EFM_SetOperateMode(uint32_t u32PgmMode)
{
    en_result_t enRet = Ok;
    uint32_t u32Timeout = 0UL;
    DDL_ASSERT(IS_VALID_EFM_OPERATE_MD(u32PgmMode));
    DDL_ASSERT(IS_VALID_EFM_UNLOCK());
    DDL_ASSERT(IS_VALID_EFM_FWMC_UNLOCK());
    while ((READ_REG32(M4_EFM->FSR) & 0x01000100UL) != 0x01000100UL)
    {
        u32Timeout ++;
        if (u32Timeout > EFM_SEQ_PGM_TIMEOUT)
        {
            enRet = ErrorTimeout;
            break;
        }
    }
    if (enRet == Ok)
    {
        /* Set the program or erase mode. */
        MODIFY_REG32(M4_EFM->FWMC, EFM_FWMC_PEMOD, u32PgmMode);
    }
    return enRet;
}

/**
 * @brief  Enable or Disable EFM interrupt.
 * @param  [in] u32EfmInt               Specifies the FLASH interrupt source and status.
 *   @arg  EFM_INT_OPTEND:              End of EFM Operation Interrupt source
 *   @arg  EFM_INT_PEERR:               Program/erase error Interrupt source
 *   @arg  EFM_INT_RDCOLERR:            Read collide error Interrupt source
 * @param  [in] enNewState              The new state of specified interrupt.
 *  This parameter can be: Enable or Disable.
 * @retval None
 * @note   Call EFM_Unlock() unlock EFM register first.
 */
void EFM_InterruptCmd(uint32_t u32EfmInt, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_EFM_INT_SEL(u32EfmInt));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_VALID_EFM_UNLOCK());
    if(Enable == enNewState)
    {
        SET_REG32_BIT(M4_EFM->FITE, u32EfmInt);
    }
    else
    {
        CLEAR_REG32_BIT(M4_EFM->FITE, u32EfmInt);
    }
}

/**
 * @brief  Checks whether the specified FLASH flag is set or not.
 * @param  [in] u32Flag                    Specifies the FLASH flag to check.
 *   @arg  EFM_FLAG_OTPWERR0:              Flash0 otp Programming/erase error flag.
 *   @arg  EFM_FLAG_PRTWERR0:              Flash0 write protect address error flag.
 *   @arg  EFM_FLAG_PGSZERR0:              Flash0 programming size error flag.
 *   @arg  EFM_FLAG_MISMTCH0:              Flash0 programming missing match error flag.
 *   @arg  EFM_FLAG_OPTEND0:               Flash0 end of operation flag.
 *   @arg  EFM_FLAG_CLOLERR0:              Flash0 read write error flag.
 *   @arg  EFM_FLAG_RDY0:                  Flash0 ready flag.
 *   @arg  EFM_FLAG_PRTWERR1:              Flash1 write protect address error flag.
 *   @arg  EFM_FLAG_PGSZERR1:              Flash1 programming size error flag.
 *   @arg  EFM_FLAG_MISMTCH1:              Flash1 programming missing match error flag.
 *   @arg  EFM_FLAG_OPTEND1:               Flash1 end of operation flag.
 *   @arg  EFM_FLAG_CLOLERR1:              Flash1 read write error flag.
 *   @arg  EFM_FLAG_RDY1:                  Flash1 ready flag.
 * @retval An en_flag_status_t enumeration value:
 *         - Set: flag is set
 *         - Reset: flag is reset
 */
en_flag_status_t EFM_GetFlagStatus(uint32_t u32Flag)
{
    DDL_ASSERT(IS_VALID_EFM_FLAG(u32Flag));
    return ((0UL == READ_REG32_BIT(M4_EFM->FSR, u32Flag)) ? Reset :Set);
}

/**
 * @brief  Clear the flash flag.
 * @param  [in] u32Flag                  Specifies the FLASH flag to clear.
 *   @arg  EFM_FLAG_CLR_OTPWERR0:        Clear Flash0 otp Programming/erase error flag
 *   @arg  EFM_FLAG_CLR_PRTWERR0:        Clear Flash0 write protect address error flag
 *   @arg  EFM_FLAG_CLR_PGSZERR0:        Clear Flash0 programming size error flag
 *   @arg  EFM_FLAG_CLR_MISMTCH0:        Clear Flash0 programming miss match error flag
 *   @arg  EFM_FLAG_CLR_OPTEND0:         Clear Flash0 end of operation flag
 *   @arg  EFM_FLAG_CLR_CLOLERR0:        Clear Flash0 read collide error flag
 *   @arg  EFM_FLAG_CLR_PRTWERR1:        Clear Flash1 write protect address error flag
 *   @arg  EFM_FLAG_CLR_PGSZERR1:        Clear Flash1 programming size error flag
 *   @arg  EFM_FLAG_CLR_MISMTCH1:        Clear Flash1 programming miss match error flag
 *   @arg  EFM_FLAG_CLR_OPTEND1:         Clear Flash1 end of operation flag
 *   @arg  EFM_FLAG_CLR_CLOLERR1:        Clear Flash1 read collide error flag
 * @retval None
 * @note   Call EFM_Unlock() unlock EFM register first.
 */
void EFM_ClearFlag(uint32_t u32Flag)
{
    DDL_ASSERT(IS_VALID_EFM_CLRFLAG(u32Flag));
    DDL_ASSERT(IS_VALID_EFM_UNLOCK());

    SET_REG32_BIT(M4_EFM->FSCLR, u32Flag);
}

/**
 * @brief  Sector protected register lock.
 * @param  [in] u32EfmRegLock                  Specifies sector protected register locking.
 *  @arg   EFM_WRLOCK0:                        F0NWPRT0 controlled sector lock
 *  @arg   EFM_WRLOCK1:                        F0NWPRT1 controlled sector lock
 *  @arg   EFM_WRLOCK2:                        F0NWPRT2 controlled sector lock
 *  @arg   EFM_WRLOCK3:                        F0NWPRT3 controlled sector lock
 *  @arg   EFM_WRLOCK4:                        F1NWPRT0 controlled sector lock
 *  @arg   EFM_WRLOCK5:                        F1NWPRT1 controlled sector lock
 *  @arg   EFM_WRLOCK6:                        F1NWPRT2 controlled sector lock
 *  @arg   EFM_WRLOCK7:                        F1NWPRT3 controlled sector lock
 * @retval None
 * @note   Call EFM_Unlock() unlock EFM register first.
 */
void EFM_SectorRegLock(uint32_t u32EfmRegLock)
{
    DDL_ASSERT(IS_VALID_EFM_REG_LOCK(u32EfmRegLock));
    DDL_ASSERT(IS_VALID_EFM_UNLOCK());

    SET_REG32_BIT(M4_EFM->WLOCK, u32EfmRegLock);
}

/**
 * @brief  Set sector lock or unlock (Single).
 * @param  [in] u8SectorNum                   Specifies sector for unlock.
 *  This parameter can be set 0~255
 * @param  [in] enNewState                    The new status of specified sector lock or unlock.
 *  This parameter can be: Enable or Disable.
 * @retval None
 * @note   Call EFM_Unlock() unlock EFM register first.
 *         If you want to unlock sequential sectors,Please call EFM_SectorCmd_Sequential function
 */
void EFM_SectorCmd_Single(uint8_t u8SectorNum, en_functional_state_t enNewState)
{
    __IO uint32_t *EFM_FxNWPRTy;
    const uint8_t u8RegIndex = u8SectorNum / REG_LENGTH;
    const uint8_t u8BitPos = u8SectorNum % REG_LENGTH;
    DDL_ASSERT(IS_VALID_EFM_UNLOCK());
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    EFM_FxNWPRTy = (__IO uint32_t*)((uint32_t)(&M4_EFM->F0NWPRT0) + ((uint32_t)u8RegIndex << 2UL));
    MODIFY_REG32(*EFM_FxNWPRTy, 1UL<<u8BitPos, (uint32_t)enNewState<<u8BitPos);
}

/**
 * @brief  Set sector lock or unlock (Sequential).
 * @param  [in] u32StartAddr                  Specifies start address for unlock.
 * @param  [in] u16SectorCnt                  Specifies length for unlock.
 *  This parameter can be set 0~256.
 * @param  [in] enNewState                    The new status of specified sector lock or unlock.
 *  This parameter can be: Enable or Disable.
 * @retval An en_result_t enumeration value:
 *         - Ok: Operate successfully.
 *         - ErrorInvalidParameter: Invalid parameter
 * @note   Call EFM_Unlock() unlock EFM register first.
 *         If you want to unlock a sector,Please call EFM_SectorCmd_Single function
 */
en_result_t EFM_SectorCmd_Sequential(uint32_t u32StartAddr, uint16_t u16SectorCnt, en_functional_state_t enNewState)
{
    en_result_t enRet = ErrorInvalidParameter;
    __IO uint32_t *EFM_FxNWPRTy;
    uint32_t StartSect;
    uint32_t EndSect;
    uint32_t EndAddr;
    uint16_t Num;
    uint16_t NeedSector;
    uint16_t StartRegIndex;
    uint16_t StartBitPos;
    uint16_t EndRegIndex;
    uint16_t EndBitPos;
    EndAddr = u32StartAddr + u16SectorCnt * SECTOR_SIZE -1U;
    DDL_ASSERT(IS_VALID_EFM_UNLOCK());
    DDL_ASSERT(IS_VALID_EFM_SECTOR_NUM(u16SectorCnt));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if(EndAddr < EFM_END_ADDR + SECTOR_SIZE)
    {
        StartSect = (uint16_t)(u32StartAddr / SECTOR_SIZE);            /* Calculate the start sector */
        NeedSector = u16SectorCnt;                                     /* Calculate the required sectors */
        EndSect = (uint16_t)(StartSect + NeedSector - 1U);             /* Calculate the end sector */
        StartRegIndex = (uint16_t)(StartSect / REG_LENGTH);            /* Register offset for the start sector */
        StartBitPos = (uint16_t)(StartSect % REG_LENGTH);              /* Bit offset for the start sector */
        EndRegIndex = (uint16_t)(EndSect / REG_LENGTH);                /* Register offset for the end sector */
        EndBitPos = (uint16_t)(EndSect % REG_LENGTH);                  /* Bit offset for the end sector */

        EFM_FxNWPRTy = (__IO uint32_t*)((uint32_t)(&M4_EFM->F0NWPRT0) + ((uint32_t)StartRegIndex << 2UL));

