RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_efm.c
        if(StartRegIndex == EndRegIndex)
        {
            for(Num = StartBitPos; Num <= EndBitPos; Num++)
            {
                MODIFY_REG32(*EFM_FxNWPRTy,(uint32_t)1UL<<Num,(uint32_t)enNewState<<Num);
            }
        }
        else
        {
            for(Num = StartBitPos; Num < REG_LENGTH; Num++)
            {
                MODIFY_REG32(*EFM_FxNWPRTy,(uint32_t)1UL<<Num,(uint32_t)enNewState<<Num);
            }
            StartRegIndex += 1U;
            EFM_FxNWPRTy = (__IO uint32_t*)((uint32_t)(&M4_EFM->F0NWPRT0) + ((uint32_t)EndRegIndex << 2U));
            for(Num = 0U;Num <= EndBitPos;Num++)
            {
                MODIFY_REG32(*EFM_FxNWPRTy, (uint32_t)1UL<<Num, (uint32_t)enNewState<<Num);
            }

            while(StartRegIndex < EndRegIndex)
            {
                EFM_FxNWPRTy = (__IO uint32_t*)((uint32_t)(&M4_EFM->F0NWPRT0) + ((uint32_t)StartRegIndex << 2U));
                if(enNewState == Enable)
                {
                    WRITE_REG32(*EFM_FxNWPRTy, 0xFFFFFFFFUL);
                }
                else
                {
                    WRITE_REG32(*EFM_FxNWPRTy, 0x0UL);
                }
                StartRegIndex += 1U;
            }
        enRet = Ok;
        }
    }
    return enRet;
}

/**
 * @brief  Set bus status while flash program or erase.
 * @param  [in] u32Status                  Specifies the new bus status while flash program or erase.
 *  This parameter can be one of the following values:
 *   @arg  EFM_BUS_BUSY:                   Bus busy while flash program or erase.
 *   @arg  EFM_BUS_RELEASE:                Bus releas while flash program or erase.
 * @retval None
 * @note   Call EFM_Unlock() and EFM_FWMC_Unlock() unlock EFM_FWMC register first.
 */
void EFM_SetBusStatus(uint32_t u32Status)
{
    DDL_ASSERT(IS_VALID_EFM_BUS_STATUS(u32Status));
    DDL_ASSERT(IS_VALID_EFM_UNLOCK());
    DDL_ASSERT(IS_VALID_EFM_FWMC_UNLOCK());

    MODIFY_REG32(M4_EFM->FWMC, EFM_FWMC_BUSHLDCTL, u32Status);
}

/**
 * @brief  Flash single program mode.
 * @param  [in] u32Addr                   The specified program address.
 * @param  [in] u32Data                   The specified program data.
 * @retval An en_result_t enumeration value:
 *         - Ok: program success
 *         - Error: program error
 *         - ErrorTimeout: program error timeout
 * @note  The address should be word align.
 *        Call EFM_Unlock() unlock EFM register first.
 */
en_result_t EFM_SingleProgram(uint32_t u32Addr, uint32_t u32Data)
{
    en_result_t enRet = Ok;
    uint32_t u32Timeout = 0UL;
    uint32_t u32tmp;
    uint32_t u32EfmFlag = EFM_FLAG_RDY1;
    uint32_t u32EfmClrFlag = EFM_FLAG_CLR_OPTEND1;

    DDL_ASSERT(IS_VALID_EFM_ADDR(u32Addr));
    DDL_ASSERT(IS_VALID_EFM_ADDR_ALIGNMENT(u32Addr));
    DDL_ASSERT(IS_VALID_EFM_UNLOCK());

    /* Clear the error flag. */
    EFM_ClearFlag(EFM_CLR_FLAG_MASK);
    /* Get CACHE status */
    u32tmp = READ_REG32_BIT(M4_EFM->FRMC, EFM_CACHE_MASK);
    /* Disable CACHE function */
    CLEAR_REG32_BIT(M4_EFM->FRMC, EFM_CACHE_MASK);
    /* Set single program mode. */
    MODIFY_REG32(M4_EFM->FWMC, EFM_FWMC_PEMOD, EFM_MODE_PROGRAMSINGLE);
    /* Program data. */
    RW_MEM32(u32Addr) = (uint32_t)u32Data;
    if((u32Addr < EFM_ADDR_SECTOR128) || (u32Addr >= EFM_OTP_BLOCK16))
    {
        u32EfmFlag = EFM_FLAG_RDY0;
        u32EfmClrFlag = EFM_FLAG_CLR_OPTEND0;
    }
    /* Wait for operation end  */
    while(Set != EFM_GetFlagStatus(u32EfmFlag))
    {
        u32Timeout ++;
        if(u32Timeout >= EFM_PGM_TIMEOUT)
        {
            enRet = ErrorTimeout;
            break;
        }
    }
    if(u32Data != RW_MEM32(u32Addr))
    {
        enRet = Error;
    }
    /* CLear the end of operate flag */
    EFM_ClearFlag(u32EfmClrFlag);
    /* Set read only mode. */
    MODIFY_REG32(M4_EFM->FWMC, EFM_FWMC_PEMOD, EFM_MODE_READONLY);
    /* Recover CACHE function */
    MODIFY_REG32(M4_EFM->FRMC, EFM_CACHE_MASK, u32tmp);

    return enRet;
}

/**
 * @brief  Flash single program with read back.
 * @param  [in] u32Addr                   The specified program address.
 * @param  [in] u32Data                   The specified program data.
 * @retval An en_result_t enumeration value:
 *         - Ok: program success
 *         - Error: program error
 *         - ErrorTimeout: program error timeout
 * @note  The address should be word align.
 *        Call EFM_Unlock() unlock EFM register first.
 */
en_result_t EFM_ProgramReadBack(uint32_t u32Addr, uint32_t u32Data)
{
    en_result_t enRet = Ok;
    uint32_t u32Timeout = 0UL;
    uint32_t u32tmp;
    uint32_t u32EfmFlag = EFM_FLAG_RDY1;
    uint32_t u32EfmClrFlag = EFM_FLAG_CLR_OPTEND1;
    uint32_t u32EfmFlag1 = EFM_FLAG_MISMTCH1;
    uint32_t u32EfmClrFlag1 = EFM_FLAG_CLR_MISMTCH1;

    DDL_ASSERT(IS_VALID_EFM_ADDR(u32Addr));
    DDL_ASSERT(IS_VALID_EFM_ADDR_ALIGNMENT(u32Addr));
    DDL_ASSERT(IS_VALID_EFM_UNLOCK());

    /* Clear the error flag. */
    EFM_ClearFlag(EFM_CLR_FLAG_MASK);
    /* Get CACHE status */
    u32tmp = READ_REG32_BIT(M4_EFM->FRMC, EFM_CACHE_MASK);
    /* Disable CACHE */
    CLEAR_REG32_BIT(M4_EFM->FRMC, EFM_CACHE_MASK);
    /* Set Program and read back mode. */
    MODIFY_REG32(M4_EFM->FWMC, EFM_FWMC_PEMOD, EFM_MODE_PROGRAMREADBACK);
    /* Program data. */
    RW_MEM32(u32Addr) = (uint32_t)u32Data;
    if((u32Addr < EFM_ADDR_SECTOR128) || (u32Addr >= EFM_OTP_BLOCK16))
    {
        u32EfmFlag = EFM_FLAG_RDY0;
        u32EfmClrFlag = EFM_FLAG_CLR_OPTEND0;
        u32EfmFlag1 = EFM_FLAG_MISMTCH0;
        u32EfmClrFlag1 = EFM_FLAG_CLR_MISMTCH0;
    }
    while(Set != EFM_GetFlagStatus(u32EfmFlag))
    {
        u32Timeout ++;
        if(u32Timeout >= EFM_PGM_TIMEOUT)
        {
            enRet = ErrorTimeout;
            break;
        }
    }
    /* Get the flag MISMTCH0*/
    if(Set == EFM_GetFlagStatus(u32EfmFlag1))
    {
        /* Clear flag PGMISMTCH */
        EFM_ClearFlag(u32EfmClrFlag1);
        enRet = Error;
    }
    /* CLear the end of operate flag */
    EFM_ClearFlag(u32EfmClrFlag);
    /* Set read only mode. */
    MODIFY_REG32(M4_EFM->FWMC, EFM_FWMC_PEMOD, EFM_MODE_READONLY);
    /* recover CACHE function */
    MODIFY_REG32(M4_EFM->FRMC, EFM_CACHE_MASK, u32tmp);

    return enRet;
}

/**
 * @brief  Flash sequence program.
 * @param  [in] u32Addr                   The specified program address.
 * @param  [in] u32Len                    The len of specified program data.
 * @param  [in] pu32Buf                   The pointer of specified program data.
 * @retval An en_result_t enumeration value:
 *         - Ok: program success
 *         - ErrorTimeout: program error timeout
 * @note  The address should be word align.
 *        Call EFM_Unlock() unlock EFM register first.
 */
en_result_t EFM_SequenceProgram(uint32_t u32Addr, uint32_t u32Len, const uint32_t *pu32Buf)
{
    en_result_t enRet = Ok;
    uint32_t u32Timeout;
    uint32_t u32tmp;
    uint32_t u32LoopWords = u32Len >> 2UL;
    uint32_t u32EfmFlag = EFM_FLAG_OPTEND0;
    uint32_t u32EfmFlag1 = EFM_FLAG_RDY0;
    uint32_t u32EfmClrFlag = EFM_FLAG_CLR_OPTEND0;
    uint32_t u32SrcDataAddr = (uint32_t)pu32Buf;
    DDL_ASSERT(IS_VALID_EFM_ADDR(u32Addr));
    DDL_ASSERT(IS_VALID_EFM_ADDR_ALIGNMENT(u32Addr));
    DDL_ASSERT(IS_VALID_EFM_UNLOCK());

    /* CLear the error flag. */
    EFM_ClearFlag(EFM_CLR_FLAG_MASK);
    /* Get CACHE status */
    u32tmp = READ_REG32_BIT(M4_EFM->FRMC, EFM_CACHE_MASK);
    /* Disable CACHE */
    CLEAR_REG32_BIT(M4_EFM->FRMC, EFM_CACHE_MASK);
    /* Set sequence program mode. */
    MODIFY_REG32(M4_EFM->FWMC, EFM_FWMC_PEMOD, EFM_MODE_PROGRAMSEQUENCE);
    /* program data. */
    while((u32LoopWords--) > 0UL)
    {
        RW_MEM32(u32Addr) = RW_MEM32(u32SrcDataAddr);
        /* wait operate end. */
        if((u32Addr >= EFM_ADDR_SECTOR128) && (u32Addr < EFM_END_ADDR))
        {
            u32EfmFlag = EFM_FLAG_OPTEND1;
            u32EfmFlag1 = EFM_FLAG_RDY1;
            u32EfmClrFlag = EFM_FLAG_CLR_OPTEND1;
        }
        u32Timeout = 0UL;
        while(Set != EFM_GetFlagStatus(u32EfmFlag))
        {
            if(u32Timeout++ >= EFM_PGM_TIMEOUT)
            {
                enRet = ErrorTimeout;
                break;
            }
        }
        u32Timeout = 0UL;
        /* Clear operation end flag */
        while(Reset != EFM_GetFlagStatus(u32EfmFlag))
        {
            if(u32Timeout++ >= EFM_SEQ_PGM_TIMEOUT)
            {
                enRet = ErrorTimeout;
                break;
            }
            /* clear end flag. */
            EFM_ClearFlag(u32EfmClrFlag);
        }
        if (enRet != Ok)
        {
            break;
        }
        u32Addr += 4UL;
        u32SrcDataAddr += 4UL;
        if (u32Addr == EFM_ADDR_SECTOR128)
        {
            /* Set read only mode. */
            MODIFY_REG32(M4_EFM->FWMC, EFM_FWMC_PEMOD, EFM_MODE_READONLY);
            u32Timeout = 0UL;
            /* wait for flash ready . */
            while(Set != EFM_GetFlagStatus(u32EfmFlag1))
            {
                u32Timeout ++;
                if(u32Timeout >= EFM_PGM_TIMEOUT)
                {
                    enRet = ErrorTimeout;
                    break;
                }
            }
            if (enRet == Ok)
            {
                /* Set sequence program mode. */
                MODIFY_REG32(M4_EFM->FWMC, EFM_FWMC_PEMOD, EFM_MODE_PROGRAMSEQUENCE);
            }
        }
    }
    /* Set read only mode. */
    MODIFY_REG32(M4_EFM->FWMC, EFM_FWMC_PEMOD, EFM_MODE_READONLY);
    u32Timeout = 0UL;
    /* wait for flash ready . */
    while(Set != EFM_GetFlagStatus(u32EfmFlag1))
    {
        u32Timeout ++;
        if(u32Timeout >= EFM_PGM_TIMEOUT)
        {
            enRet = ErrorTimeout;
            break;
        }
    }
    /* Recover CACHE */
    MODIFY_REG32(M4_EFM->FRMC, EFM_CACHE_MASK, u32tmp);
    return enRet;
}

/**
 * @brief  Flash sector erase.
 * @param  [in] u32Addr                   The address in the specified sector.
 * @retval An en_result_t enumeration value:
 *         - Ok: erase success
 *         - ErrorTimeout: program error timeout
 * @note   The address should be word align.
 *         Call EFM_Unlock() unlock EFM register first.
 */
en_result_t EFM_SectorErase(uint32_t u32Addr)
{
    en_result_t enRet = Ok;
    uint32_t u32Timeout = 0UL;
    uint32_t u32tmp;
    uint32_t u32EfmFlag = EFM_FLAG_RDY1;
    uint32_t u32EfmClrFlag = EFM_FLAG_CLR_OPTEND1;

    DDL_ASSERT(IS_VALID_EFM_ADDR(u32Addr));
    DDL_ASSERT(IS_VALID_EFM_UNLOCK());

    /* CLear the error flag. */
    EFM_ClearFlag(EFM_CLR_FLAG_MASK);
    /* Get CACHE status */
    u32tmp = READ_REG32_BIT(M4_EFM->FRMC, EFM_CACHE_MASK);
    /* Disable CACHE */
    CLEAR_REG32_BIT(M4_EFM->FRMC, EFM_CACHE_MASK);
    /* Set sector erase mode. */
    MODIFY_REG32(M4_EFM->FWMC, EFM_FWMC_PEMOD, EFM_MODE_ERASESECTOR);
    /* Erase */
    RW_MEM32(u32Addr & 0xFFFFFFFCUL) = (uint32_t)0UL;
    if((u32Addr < EFM_ADDR_SECTOR128) || (u32Addr >= EFM_OTP_BLOCK16))
    {
        u32EfmFlag = EFM_FLAG_RDY0;
        u32EfmClrFlag = EFM_FLAG_CLR_OPTEND0;
    }
    while(Set != EFM_GetFlagStatus(u32EfmFlag))
    {
        u32Timeout ++;
        if(u32Timeout >= EFM_ERASE_TIMEOUT)
        {
            enRet = ErrorTimeout;
            break;
        }
    }
    /* Clear the end of operate flag */
    EFM_ClearFlag(u32EfmClrFlag);
    /* Set read only mode. */
    MODIFY_REG32(M4_EFM->FWMC, EFM_FWMC_PEMOD, EFM_MODE_READONLY);
    /* Recover CACHE */
    MODIFY_REG32(M4_EFM->FRMC, EFM_CACHE_MASK, u32tmp);

    return enRet;
}

/**
 * @brief  Flash OTP lock.
 * @param  [in]  u32Addr           Specifies the OTP block
 * @retval An en_result_t enumeration value:
 *         - Ok: program success
 *         - ErrorInvalidParameter: Invalid parameter
 * @note   The address should be word align.
 *         Call EFM_Unlock() and EFM_OTP_WP_Unlock() unlock EFM_FWMC register first.
 */
en_result_t EFM_OTPLock(uint32_t u32Addr)
{
    en_result_t enRet = ErrorInvalidParameter;
    uint32_t u32Timeout = 0UL;

    if((u32Addr >= OTP_LOCK_ADDR_START) && (u32Addr < OTP_LOCK_ADDR_END ))
    {
        DDL_ASSERT(IS_VALID_EFM_UNLOCK());
        DDL_ASSERT(IS_VALID_EFM_OTP_UNLOCK());

