RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_efm.c
        enRet = Ok;
        /* Set single program mode. */
        MODIFY_REG32(M4_EFM->FWMC, EFM_FWMC_PEMOD, EFM_MODE_PROGRAMSINGLE);
        /* Enable OTP */
        RW_MEM32(OTP_ENABLE_ADDR) = (uint32_t)0UL;
        /* Wait for operation end */
        while(Set != EFM_GetFlagStatus(EFM_FLAG_RDY0))
        {
            u32Timeout ++;
            if(u32Timeout >= EFM_PGM_TIMEOUT)
            {
                enRet = ErrorTimeout;
                break;
            }
        }
        /* CLear the end of operate flag */
        EFM_ClearFlag(EFM_FLAG_CLR_OPTEND0);
        if (enRet == Ok)
        {
            /* OTP latch */
            RW_MEM32(u32Addr & 0xFFFFFFFCUL) = (uint32_t)0UL;
            /* Wait for operation end */
            u32Timeout = 0UL;
            while(Set != EFM_GetFlagStatus(EFM_FLAG_RDY0))
            {
                u32Timeout ++;
                if(u32Timeout >= EFM_PGM_TIMEOUT)
                {
                    enRet = ErrorTimeout;
                    break;
                }
            }
        }
        /* CLear the end of operate flag */
        EFM_ClearFlag(EFM_FLAG_CLR_OPTEND0);
        /* Set read only mode. */
        MODIFY_REG32(M4_EFM->FWMC, EFM_FWMC_PEMOD, EFM_MODE_READONLY);
    }

    return enRet;
}

/**
 * @brief  Flash chip erase.
 * @param  [in]  EraseMode      Specifies the FLASH erase mode.
 *   @arg  EFM_MODE_ERASECHIP1  A flash Chip erase mode
 *   @arg  EFM_MODE_ERASECHIP1  Two flash Chip erase mode
 * @param  [in]  u32Addr        Specifies the FLASH block
 * @retval An en_result_t enumeration value:
 *         - Ok: program success
 *         - ErrorTimeout: program error timeout
 * @note   The address should be word align.
 *         Call EFM_Unlock() unlock EFM register first.
 */
en_result_t EFM_ChipErase(uint32_t EraseMode, uint32_t u32Addr)
{
    en_result_t enRet = Ok;
    uint32_t u32Timeout = 0UL;
    uint32_t u32tmp;
    uint32_t u32EfmFlag;
    uint32_t u32EfmClrFlag;

    DDL_ASSERT(IS_VALID_EFM_ERASE_MODE(EraseMode));
    DDL_ASSERT(IS_VALID_EFM_CHIP_ERASE_ADDR(u32Addr));
    DDL_ASSERT(IS_VALID_EFM_UNLOCK());

    /* CLear the error flag. */
    EFM_ClearFlag(EFM_CLR_FLAG_MASK);
    /* Get CACHE status */
    u32tmp = READ_REG32_BIT(M4_EFM->FRMC, EFM_CACHE_MASK);
    /* Disable CACHE */
    CLEAR_REG32_BIT(M4_EFM->FRMC, EFM_CACHE_MASK);
    /* If wsap enable, Disable it */
    if (RW_MEM32(EFM_SWAP_ADDR) == EFM_SWAP_DATA)
    {
        /* Set Sector erase mode. */
        MODIFY_REG32(M4_EFM->FWMC, EFM_FWMC_PEMOD, EFM_MODE_ERASESECTOR);
        /* Disable flash switch function */
        RW_MEM32(EFM_SWAP_ADDR) = 0x0UL;
        while(Set != EFM_GetFlagStatus(EFM_FLAG_OPTEND0))
        {
            u32Timeout ++;
            if(u32Timeout >= EFM_ERASE_TIMEOUT)
            {
                enRet = ErrorTimeout;
                break;
            }
        }
        /* CLear the end of operate flag */
        EFM_ClearFlag(EFM_FLAG_CLR_OPTEND0);
    }
    /* Set chip erase mode. */
    MODIFY_REG32(M4_EFM->FWMC, EFM_FWMC_PEMOD, EraseMode);
    if(EraseMode == EFM_MODE_ERASECHIP1)
    {
        if (u32Addr >= EFM_ADDR_SECTOR128)
        {
            u32EfmFlag = EFM_FLAG_RDY1;
            u32EfmClrFlag = EFM_FLAG_CLR_OPTEND1;
            /* Flash1 disables write protection  */
            WRITE_REG32(M4_EFM->F1NWPRT0, 0xFFFFFFFFUL);
            WRITE_REG32(M4_EFM->F1NWPRT1, 0xFFFFFFFFUL);
            WRITE_REG32(M4_EFM->F1NWPRT2, 0xFFFFFFFFUL);
            WRITE_REG32(M4_EFM->F1NWPRT3, 0xFFFFFFFFUL);
        }
        else
        {
            u32EfmFlag = EFM_FLAG_RDY0;
            u32EfmClrFlag = EFM_FLAG_CLR_OPTEND0;
            /* Flash0 disables write protection  */
            WRITE_REG32(M4_EFM->F0NWPRT0, 0xFFFFFFFFUL);
            WRITE_REG32(M4_EFM->F0NWPRT1, 0xFFFFFFFFUL);
            WRITE_REG32(M4_EFM->F0NWPRT2, 0xFFFFFFFFUL);
            WRITE_REG32(M4_EFM->F0NWPRT3, 0xFFFFFFFFUL);
        }

        /* Erase */
        RW_MEM32(u32Addr & 0xFFFFFFFCUL) = (uint32_t)0UL;
        while(Set != EFM_GetFlagStatus(u32EfmFlag))
        {
            u32Timeout ++;
            if(u32Timeout >= EFM_ERASE_TIMEOUT)
            {
                enRet = ErrorTimeout;
                break;
            }
        }
        /* CLear the end of operate flag */
        EFM_ClearFlag(u32EfmClrFlag);
    }
    else
    {
            /* Flash0 and Flash1 disables write protection  */
            WRITE_REG32(M4_EFM->F0NWPRT0, 0xFFFFFFFFUL);
            WRITE_REG32(M4_EFM->F0NWPRT1, 0xFFFFFFFFUL);
            WRITE_REG32(M4_EFM->F0NWPRT2, 0xFFFFFFFFUL);
            WRITE_REG32(M4_EFM->F0NWPRT3, 0xFFFFFFFFUL);
            WRITE_REG32(M4_EFM->F1NWPRT0, 0xFFFFFFFFUL);
            WRITE_REG32(M4_EFM->F1NWPRT1, 0xFFFFFFFFUL);
            WRITE_REG32(M4_EFM->F1NWPRT2, 0xFFFFFFFFUL);
            WRITE_REG32(M4_EFM->F1NWPRT3, 0xFFFFFFFFUL);
        /* Erase */
        RW_MEM32(u32Addr & 0xFFFFFFFCUL) = (uint32_t)0UL;
        while(Set != EFM_GetFlagStatus(EFM_FLAG_RDY0))
        {
            u32Timeout ++;
            if(u32Timeout >= EFM_ERASE_TIMEOUT)
            {
                enRet = ErrorTimeout;
                break;
            }
        }
        /* CLear the end of operate flag */
        EFM_ClearFlag(EFM_FLAG_CLR_OPTEND0);
        EFM_ClearFlag(EFM_FLAG_CLR_OPTEND1);
    }
    /* Set read only mode. */
    MODIFY_REG32(M4_EFM->FWMC, EFM_FWMC_PEMOD, EFM_MODE_READONLY);
    /* recover CACHE */
    MODIFY_REG32(M4_EFM->FRMC, EFM_CACHE_MASK, u32tmp);
    return enRet;
}

/**
 * @brief  Enable or disable the EFM swap function.
 * @param  [in] enNewState                The new state of the flash swap function.
 *   @arg  This parameter can be: Enable or Disable.
 * @retval An en_result_t enumeration value:
 *         - Ok: program success
 *         - ErrorTimeout: program error timeout
 * @note   Call EFM_Unlock() unlock EFM register first.
 */
en_result_t EFM_SwapCmd(en_functional_state_t enNewState)
{
    en_result_t enRet = Ok;
    uint32_t u32Timeout = 0UL;

