RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_efm.c
    DDL_ASSERT(IS_VALID_EFM_UNLOCK());
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    if (enNewState ==Enable)
    {
        /* Set Program single mode. */
        MODIFY_REG32(M4_EFM->FWMC, EFM_FWMC_PEMOD, EFM_MODE_PROGRAMSINGLE);
        /* Enable flash swap function */
        RW_MEM32(EFM_SWAP_ADDR) = EFM_SWAP_DATA;
        while(Set != EFM_GetFlagStatus(EFM_FLAG_OPTEND0))
        {
            u32Timeout ++;
            if(u32Timeout >= EFM_PGM_TIMEOUT)
            {
                enRet = ErrorTimeout;
                break;
            }
        }
        /* CLear the end of operate flag */
        EFM_ClearFlag(EFM_FLAG_CLR_OPTEND0);
    }
    else{
        /* Set Sector erase mode. */
        MODIFY_REG32(M4_EFM->FWMC, EFM_FWMC_PEMOD, EFM_MODE_ERASESECTOR);
        /* Disable flash switch function */
        RW_MEM32(EFM_SWAP_ADDR) = 0x0UL;
        while(Set != EFM_GetFlagStatus(EFM_FLAG_OPTEND0))
        {
            u32Timeout ++;
            if(u32Timeout >= EFM_ERASE_TIMEOUT)
            {
                enRet = ErrorTimeout;
                break;
            }
        }
        /* CLear the end of operate flag */
        EFM_ClearFlag(EFM_FLAG_CLR_OPTEND0);
    }
    /* Set read only mode. */
    MODIFY_REG32(M4_EFM->FWMC, EFM_FWMC_PEMOD, EFM_MODE_READONLY);

    return enRet;
}

/**
 * @brief  Get chip ID.
 * @param  None
 * @retval Returns the value of the Chip ID
 */
uint32_t EFM_GetCID(void)
{
    uint32_t u32CID;
    u32CID = M4_EFM->FHDFG;
    return u32CID;
}

/**
 * @brief  Get unique ID.
 * @param  [out] stcUID      Unique ID struct
 * @retval Returns the value of the unique ID
 */
void EFM_GetUID(stc_efm_unique_id_t *stcUID)
{
    stcUID->u32UniqueID0 = READ_REG32(M4_EFM->UQID0);
    stcUID->u32UniqueID1 = READ_REG32(M4_EFM->UQID1);
    stcUID->u32UniqueID2 = READ_REG32(M4_EFM->UQID2);
}

/**
 * @}
 */

#endif  /* DDL_EFM_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
